In [3]:
import pandas as pd

In [11]:
df=pd.read_csv('testdata2.csv.txt')

In [12]:
df

   deptno    ename
0       1    Alice
1       1      Bob
2       2  Charlie
3       2    David
4       3      Eve

In [15]:
a=df.groupby('deptno') ['ename'].count()
print(a)

deptno
1    2
2    2
3    1
Name: ename, dtype: int64

In [7]:
ab=df.groupby('job_title')['age'].sum()
print(ab)

job_title
Engineer     58
Manager     130
Name: age, dtype: int64

In [10]:
a = df.groupby('job_title').agg(mean_age=('age', 'sum'))
print(a)

           mean_age
job_title
Engineer         58
Manager         130

In [16]:
df1 = pd.DataFrame({
    'deptno': [10, 20, 10, 30, 20, 10],
    'ename': ['John', 'Anna', 'Steve', 'Mike', 'Sara', 'Chris']
})

In [17]:
df1

   deptno  ename
0      10   John
1      20   Anna
2      10  Steve
3      30   Mike
4      20   Sara
5      10  Chris

In [18]:
b=df1.groupby('deptno')['ename'].count()

In [19]:
b

deptno
10    3
20    2
30    1
Name: ename, dtype: int64

In [20]:
data={'category':['A','B','A','B','A'],
      'values':[10,20,30,40,50]}

In [21]:
df2=pd.DataFrame(data)

In [22]:
df2

  category  values
0        A      10
1        B      20
2        A      30
3        B      40
4        A      50

In [26]:
c=df2.groupby('category')['values'].sum()

In [27]:
c

category
A    90
B    60
Name: values, dtype: int64

In [28]:
data1 = {'Category': ['A', 'B', 'A', 'B', 'A'],
'Type': ['X', 'X', 'Y', 'Y', 'Y'],
'Values': [10, 20, 30, 40, 50]}

In [29]:
df3=pd.DataFrame(data1)

In [30]:
df3

  Category Type  Values
0        A    X      10
1        B    X      20
2        A    Y      30
3        B    Y      40
4        A    Y      50

In [32]:
c=df3.groupby(['Category','Type'])['Values'].sum()

In [33]:
c

Category  Type
A         X       10
          Y       80
B         X       20
          Y       40
Name: Values, dtype: int64